SunCity/src/Catalogs/ВариантыРаспределенияТоваров/ВариантыРаспределенияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыРаспределенияТоваров</name>
  <predefined>
    <items>
      <name>ПриОтгрузкеПоОстаткам</name>
      <description>При отгрузке по остаткам</description>
    </items>
    <items>
      <name>ПриПоступленииПоПотребностям</name>
      <description>При поступлении по потребностям</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользоватьПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныеНастройкиДляМагазинов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/InformationRegisters/НастройкиВариантовРаспределенияТоваров/НастройкиВариантовРаспределенияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиВариантовРаспределенияТоваров</name>
  <resources>
    <name>НастройкиВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВариантРаспределенияТоваров</name>
    <type>
      <types>CatalogRef.ВариантыРаспределенияТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/Catalogs/ВариантыРаспределенияТоваров/Forms/ФормаНастройкиРаспределенияПоОстаткам/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Магазин") Тогда
		Магазин = Параметры.Магазин;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("СохранениеНастроек") Тогда
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Параметры.СохранениеНастроек;
	Иначе
		Элементы.ОткрыватьНастройкиПередРаспределением.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокОсновнойКнопки") Тогда
		Элементы.ФормаСохранитьИЗакрыть.Заголовок = Параметры.ЗаголовокОсновнойКнопки;
	КонецЕсли;
	
	ВариантРаспределенияТоваров = Справочники.ВариантыРаспределенияТоваров.ПриОтгрузкеПоОстаткам;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ НастройкиВарианта, ПрименятьАвтоматически
	|ИЗ РегистрСведений.НастройкиВариантовРаспределенияТоваров КАК Настройки
	|ГДЕ ВариантРаспределенияТоваров = &ВариантРаспределенияТоваров И Магазин = &Магазин";
	Запрос.УстановитьПараметр("ВариантРаспределенияТоваров", ВариантРаспределенияТоваров);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ОткрыватьНастройкиПередРаспределением = НЕ Результат.ПрименятьАвтоматически;
		НастройкиВарианта.Загрузить(Результат.НастройкиВарианта.Получить());
	КонецЕсли;
	
	ИспользованныеСклады = Новый Массив();
	Для Каждого Строка Из НастройкиВарианта Цикл
		ИспользованныеСклады.Добавить(Строка.Склад);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Магазин = &Магазин
	|	И НЕ Склады.Ссылка В (&ИспользованныеСклады)
	|	И НЕ Склады.ПометкаУдаления";
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ИспользованныеСклады", ИспользованныеСклады);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		НовСтр = НастройкиВарианта.Добавить();
		НовСтр.Склад = Результат.Склад;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Закрыть(СтруктураВозвратаФормы());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтруктураВозвратаФормы()
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("НастройкиВарианта", Новый ХранилищеЗначения(НастройкиВарианта.Выгрузить()));
	СтруктураРезультат.Вставить("ПрименятьАвтоматически", НЕ ОткрыватьНастройкиПередРаспределением);
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти
